#Использовать ".."
#Использовать asserts


Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоВозвращаетсяСтрока");
    
    Возврат ВсеТесты;
КонецФункции
 
Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры
 
Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоВозвращаетсяСтрока() Экспорт
    Результат = ГенераторПрокси.ОбращениеАПИ();
    Ожидаем.Что(Результат, "Ожидаем, что вернется строка").ИмеетТип("Строка");
КонецПроцедуры
