#Использовать ".."
#Использовать asserts


Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоВозвращаетсяСтрока");
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоВозвращаетсяМассив");
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоТаблицаСОздается");
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоТаблицаЗаполнена");
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоСоздаетсяПрокси");
    Возврат ВсеТесты;
КонецФункции
 
Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры
 
Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоВозвращаетсяСтрока() Экспорт
    Результат = ГенераторПрокси.ОбращениеАПИ();
    Ожидаем.Что(Результат, "Ожидаем, что вернется строка").ИмеетТип("Строка");
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоВозвращаетсяМассив() Экспорт
    Результат = ГенераторПрокси.ОбработкаРезультатаИзJSON();
    Ожидаем.Что(Результат, "Ожидаем, что вернется массив").ИмеетТип("Массив");
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоТаблицаСОздается() Экспорт
    Результат = ГенераторПрокси.СоздатьТаблицуЗначений();
    Ожидаем.Что(Результат, "Ожидаем, что таблица создается").Существует();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоТаблицаЗаполнена() Экспорт
    Результат = ГенераторПрокси.ДанныеОПроксиВТЗ();
    Ожидаем.Что(Результат, "Ожидаем, что таблица заполнена").Заполнено();
    Ожидаем.Что(Результат.Количество(), "Ожидаем, что таблица имеет минимум одну строку").Минимум(1);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоСоздаетсяПрокси() Экспорт
    Результат = ПолучитьПрокси.ПоНомеру(1);
    Ожидаем.Что(Результат, "Ожидаем, что возвращается интернет прокси").Существует();
КонецПроцедуры